dot/genomon_dna.dot
digraph "Genomon Pipeline Schemes DNA"
{
	size = "11";
	splines = true;
	fontsize = "30";
	ranksep = 0.3;
	node[fontname = "helvetica", fontsize="12"];
	graph[clusterrank = "local"];
	
	subgraph clustertasks
	{
		rank="min";
		fontname = "helvetica";
		fontcolor = "#FF3232";
		fontsize = "18";
		label = "Genomon Pipeline Schemes DNA";

		#### nodes
		# input
		t_input_bam2fastq   [color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", shape=box3d, style=filled, label="[bam_tofastq]"];
		t_input_fastq       [color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", shape=box3d, style=filled, label="[fastq]"];
		t_input_bamimport   [color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", shape=box3d, style=filled, label="[bam_import]"];

		# stage
		t_bam2fastq         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="bam2fastq"];
		t_link_import_bam   [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="link_import_bam"];
		t_link_input_fastq  [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="link_input_fastq"];
		t_split_files       [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="split_files"];
		t_map_dna_sequence  [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="map_dna_sequence"];
		t_markdup           [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="markdup"];

		# output
		t_output_bam        [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="markdup.bam"];
		

		#### lines
		# input
		t_input_bam2fastq -> t_bam2fastq[color="#0044A0"];
		t_input_fastq -> t_link_input_fastq[color="#0044A0"];
		t_input_bamimport -> t_link_import_bam[color="#0044A0"];

		# stage
		t_bam2fastq -> t_split_files[color="#0044A0"];
		t_link_input_fastq -> t_split_files[color="#0044A0"];
		t_split_files -> t_map_dna_sequence[color="#0044A0"];
		t_map_dna_sequence -> t_markdup[color="#0044A0"];
		t_link_import_bam -> t_output_bam[color="#0044A0"];
		t_markdup -> t_output_bam[color="#0044A0"];
		t_output_bam -> t_bam_stats[color="#0044A0"];
		t_output_bam -> t_coverage[color="#0044A0"];
		t_output_bam -> t_mutations[color="#0044A0"];
		t_output_bam -> t_parse_sv[color="#0044A0"];

		subgraph clustertasks_mutation
		{
			rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = " [mutation_call]";
			style = dashed;

			#### nodes
			t_mutations         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="identify_mutations"];
			t_pa_mutation       [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_mutation"];
			t_paplot_mu         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];

			# output
			t_output_mutation   [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="genomon_mutation.result.txt"];
			t_output_pa_mu_i    [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="capture.IGV"];
			t_output_pa_mu_m    [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			t_output_paplot_mu  [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];

			#### lines
			# output
			t_mutations -> t_output_mutation[color="#0044A0"];

			#### post_analysis
			t_output_mutation -> t_pa_mutation[color="#0044A0"];
			t_pa_mutation -> t_output_pa_mu_m[color="#0044A0"];
			t_pa_mutation -> t_output_pa_mu_i[color="#0044A0"];

			#### paplot
			t_output_pa_mu_m -> t_paplot_mu[color="#0044A0"];
			t_paplot_mu -> t_output_paplot_mu[color="#0044A0"];
		}
		subgraph clustertasks_sv
		{
			rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = "[sv_detection]";
			style = dashed;

			#### nodes
			t_parse_sv          [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="parse_sv"];
			t_merge_sv          [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="merge_sv"];
			t_filt_sv           [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="filt_sv"];
			t_pa_sv             [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_sv"];
			t_paplot_sv         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];

			# output
			t_output_sv         [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="genomonSV.result.txt"];
			t_output_pa_sv_i    [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="capture.IGV"];
			t_output_pa_sv_m    [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			t_output_paplot_sv  [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];

			#### lines
			# stage
			t_parse_sv -> t_merge_sv[color="#0044A0"];
			t_merge_sv -> t_filt_sv[color="#0044A0"];

			# output
			t_filt_sv -> t_output_sv[color="#0044A0"];

			#### post_analysis
			t_output_sv -> t_pa_sv[color="#0044A0"];
			t_pa_sv -> t_output_pa_sv_m[color="#0044A0"];
			t_pa_sv -> t_output_pa_sv_i[color="#0044A0"];

			#### paplot
			t_output_pa_sv_m -> t_paplot_sv[color="#0044A0"];
			t_paplot_sv -> t_output_paplot_sv[color="#0044A0"];
		}
			
		subgraph clustertasks_qc
		{
			rank="min";
			fontname = "helvetica";
			fontcolor = "#0044A0";
			fontsize = "18";
			label = "[qc]";
			style = dashed;

			#### nodes
			t_bam_stats         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="bam_stats"];
			t_coverage          [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="coverage"];
			t_merge_qc          [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="merge_qc"];
			t_pa_qc             [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="post_analysis_qc"];
			t_paplot_qc         [color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", shape=box3d, style=filled, label="paplot"];

			# output
			t_output_qc         [color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", shape=box3d, style=filled, label="genomonQC.result.txt"];
			t_output_pa_qc_m    [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="merge.result"];
			t_output_paplot_qc  [color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", shape=box3d, style=filled, label="plot"];

			#### lines
			# stage
			t_bam_stats -> t_merge_qc[color="#0044A0"];
			t_coverage -> t_merge_qc[color="#0044A0"];

			# output
			t_merge_qc -> t_output_qc[color="#0044A0"];

			#### post_analysis
			t_output_qc -> t_pa_qc[color="#0044A0"];
			t_pa_qc -> t_output_pa_qc_m[color="#0044A0"];

			#### paplot
			t_output_pa_qc_m -> t_paplot_qc[color="#0044A0"];
			t_paplot_qc -> t_output_paplot_qc[color="#0044A0"];
		}
	}

	subgraph clusterkey1
	{
		rank = "min";
		style  = filled;
		
		fontname = "helvetica"
		fontsize = 16;
		color = "#F6F4F4";
		label = "Key:"

		node[margin="0.2,0.2", fontname = "helvetica", fontsize="10"];
		k1_1[color="#006000", fillcolor="#B8CC6E", fontcolor="#006000", label="Input", shape=box3d, style=filled];
		k2_1[color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", label="Task to run", shape=box3d, style=filled];
		k3_1[color="#33220D", fillcolor="#F8CA31", fontcolor="#33220D", label="Output", shape=box3d, style=filled];
		k4_1[color="#0044A0", fillcolor="#EBF3FF", fontcolor="#0044A0", label="Task to run", shape=box3d, style=filled];
		k5_1[color="#33220D", fillcolor="#EFA03B", fontcolor="#33220D", label="Post Analysis Output", shape=box3d, style=filled];
		k1_1 -> k2_1[color="#0044A0", arrowtype=normal];
		k2_1 -> k3_1[color="#0044A0", arrowtype=normal];
		k3_1 -> k4_1[color="#0044A0", arrowtype=normal];
		k4_1 -> k5_1[color="#0044A0", arrowtype=normal];
	}
}
